def resolucao():
    import time
    z = [0]
    #w = complex(input("Digite w: "))
    #M = int(input("Digite a quantidade de termos da sequência: "))
    #eps = float(input("Digite o épsilon: "))

    w = complex(0.2-0.3j) #w = complex(input('Digite o valor de w: '))
    M = 20 #M = int(input('Digite o valor de M: '))
    eps = 0.005 #eps = float(input('Digite o epsilon: '))

    z = [w]

    for k in range(M-1):
        z.append(z[k]**2 + w)
    
    tmp = [] 
    for d in range(len(z)):
        for i in range(M):
            if i <= d:
                a = 1 
            elif abs(z[d] - z[i]) >= eps:
                print(f"{d+1} {z[d]} - {z[i]} = {abs(z[d] - z[i])} {False}" , end="\n")
                #time.sleep(1)
                tmp.append({d+1 : False})
            else:
                print(f"{d+1} {z[d]} - {z[i]} = {abs(z[d] - z[i])} {True}", end="\n")
                #time.sleep(1)
                tmp.append({d+1 : True})
                
    #print(z)
    #print(len(tmp))
    print(tmp)
    print(len(z))

resolucao()

# 1 [(0.2-0.3j), 
# 2 (0.15000000000000002-0.42j), 
# 3 (0.04610000000000003-0.426j), 
# 4 (0.02064921000000003-0.3392772j), 
# 5 (0.08531737143378411-0.314011612302024j), 
# 6 (0.10867576120785366-0.35358129072258637j), 
# 7 (0.08679069192505628-0.37685143183626496j), 
# 8 (0.06551562252778698-0.3654143930440352j),
# 9 (0.07076461815146282-0.3478807028817868j), 
# 10 (0.08398664774459633-0.34923529020338423j), 
# 11 (0.08508846907593293-0.358662202596587j), 
# 12 (0.0786014719982508-0.36103603546869134j), 
# 13 (0.07583117249334165-0.35675592766450365j), 
# 14 (0.07847557479795438-0.3541064405774982j), 
# 15 (0.08076704458140409-0.3555774129279537j), 
# 16 (0.08008801890587802-0.3574378735241847j), 
# 17 (0.07865225734277721-0.3572529823449635j), 
# 18 (0.07855648419074367-0.35619750700774144j), 
# 19 (0.07929445720988056-0.3559632476560719j), 
# 20 (0.07957777726235161-0.356451825019109j)]